Import Depencies

In [1]:
from bs4 import BeautifulSoup
import requests
import os
import pandas as pd
import numpy as np

Set header to circumvent webscraping blocker

In [2]:
headers = {
    "User-agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.120 Safari/537.36"}

Create lists to store **responses**

In [3]:
# data to scrape
job_title = []
company_name = []
short_description = []
job_location = []
job_classification = []
job_subclassification = []
job_site = []

job_counter = 0

In [4]:
headers = {
     "User-agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.120 Safari/537.36"
}

Scrape the website

In [5]:
# url = 'https://www.seek.com.au/jobs-in-construction/in-All-Perth-WA'
# response = requests.get(url)
# soup = BeautifulSoup(response.content, features='html.parser')
# jobs_on_page = soup('article')

Create list of scraping variables (job fields, pages[4])

In [6]:
job_field = ['construction', 'engineering', 'healthcare-medical', 'sales', 'jobs-in-community-services-development']
page_scrapes = ['', '?page=2', '?page=3','?page=4','?page=5']

Scrape data

In [7]:
for x in job_field:

    for page in page_scrapes:

        url = 'https://www.seek.com.au/jobs-in-' + x + '/in-All-Perth-WA' + page
        response = requests.get(url, headers=headers)
        soup = BeautifulSoup(response.content, features='html.parser')
        jobs_on_page = soup('article')
            
        for i in range(len(jobs_on_page)):

            job_counter += 1 
            
            job_title.append(soup('article')[i]['aria-label'])
            job_site.append("Seek.com.au")
            short_description.append(soup('article')[i].find('span', {'data-automation':'jobShortDescription'}).text)
            job_location.append(soup('article')[i].find('a', {'data-automation':'jobLocation'}).text)
            job_subclassification.append(soup('article')[i].find('a', {'data-automation':'jobSubClassification'}).text)
            job_classification.append(soup('article')[i].find('a', {'data-automation':'jobClassification'}).text)
            
            print('Jobs scraped: %d' % job_counter, end='\r')
            
            try:
                company_name.append(soup('article')[i].find('a', {'data-automation':'jobCompany'}).text)
            except:
                company_name.append(np.nan)

-------

## Columns 

1.	Job title
2.	Company
3.	Description
4.	Location

In [8]:
###########################################################################

print(len(company_name))
print(len(job_title))
print(len(short_description))

491
491
491

In [9]:
seek_data = {'job_title': job_title,
            'company_name': company_name,
            'short_description': short_description,
            'job_location': job_location,
            'job_classification': job_classification,
            'job_subclassification': job_subclassification,
            'job_site' : job_site
             }

In [10]:
seek_data_df = pd.DataFrame(seek_data)
seek_data_df.reset_index(inplace=True)
seek_data_df.rename(columns= {'index':'job_id'}, inplace=True)
seek_data_df.tail(150)

,job_id,job_title,company_name,short_description,job_location,job_classification,job_subclassification,job_site
341,341,Sales Representative,Airco Fasteners Pty Ltd,Calling any tradies looking to hang up their b...,Perth WA,Sales,Sales Representatives/Consultants,Seek.com.au
342,342,Territory Manager,Euro Auctions,Major growth in the UK market has led to a vac...,Perth WA,Sales,Sales Representatives/Consultants,Seek.com.au
343,343,Relationship Manager - Premium Customers (WA) ...,sportsbet.com.au,As a Relationship Manager for our Premium team...,Perth WA,Sales,Account & Relationship Management,Seek.com.au
344,344,Key Account Manager - National Strategy & Deve...,Alcolizer Pty Ltd,Can you develop strategic sales plans to grow ...,Balcatta,Sales,Account & Relationship Management,Seek.com.au
345,345,Territory Manager,Bega - Dairy and Drinks,"Join the Aussie Bega family, partnering yourse...",Fremantle & Southern Suburbs,Sales,Sales Representatives/Consultants,Seek.com.au
...,...,...,...,...,...,...,...,...
486,486,Resident Wellbeing Assistant (Aged Care),Singleton Community Aged Care,Signature Care presents an exciting opportunit...,Singleton,Community Services & Development,Aged & Disability Support,Seek.com.au
487,487,Council Services Manager (Operational Manager),West Arnhem Regional Council,"Live and work in the amazing West Arnhem Land,...",Perth WA,Community Services & Development,Management,Seek.com.au
488,488,Claims Officer - Employment Services,Training Alliance Group,Review and process Employment Services claims ...,West Perth,Community Services & Development,Employment Services,Seek.com.au
489,489,"Employment Mentor, Acacia Prison",Waalitj Foundation,We're looking for a passionate Employment Ment...,Wooroloo,Community Services & Development,Indigenous & Multicultural Services,Seek.com.au
490,490,Business Manager - Earlville,Advanced Personnel Management,Looking for a move? We are looking in Cairns! ...,Perth WA,Community Services & Development,Employment Services,Seek.com.au

---

## Create dataframes for tables

---

In [35]:
# Create job_id dataframe

job_id_df = seek_data_df[['job_id', 'job_classification', 'job_location']].copy()

# rename columns to match schema
job_id_df.rename(columns= {'job_classification':'job_field'}, inplace=True)


job_id_df

     job_id                         job_field                  job_location
0         0                      Construction  Fremantle & Southern Suburbs
1         1                      Construction              Cockburn Central
2         2                      Construction                     Rivervale
3         3                      Construction                      Perth WA
4         4                      Construction                        Myaree
..      ...                               ...                           ...
486     486  Community Services & Development                     Singleton
487     487  Community Services & Development                      Perth WA
488     488  Community Services & Development                    West Perth
489     489  Community Services & Development                      Wooroloo
490     490  Community Services & Development                      Perth WA

[491 rows x 3 columns]

### Count words to plot - All Employment Fields

In [11]:
# count, tally and describe words in short_description

seek_count = (seek_data_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

In [12]:
seek_count = seek_count[seek_count['word'].str.len() > 4]
seek_count

             word  count
13    opportunity     73
18        looking     56
19        seeking     48
20    experienced     46
22          sales     44
...           ...    ...
2393  Progression      1
2394      Tuscany      1
2395        Focus      1
2396   fortnight,      1
2397        solar      1

[1975 rows x 2 columns]

In [13]:
seek_count.head(45)

            word  count
13   opportunity     73
18       looking     56
19       seeking     48
20   experienced     46
22         sales     44
23       Manager     43
25         Perth     41
30      Engineer     35
31       Project     35
33         their     31
36      projects     30
37         team.     27
38        career     25
39         based     25
40     motivated     25
42       Seeking     24
43       project     23
44      exciting     22
45    experience     21
46        people     21
48       Medical     21
50        within     20
53       leading     20
54  construction     20
55         Sales     20
57       Western     19
59       growing     17
64     available     16
65        across     15
67       working     15
68      position     15
71      business     15
72        skills     15
73       company     14
76       Support     14
77        health     14
78     currently     14
79    management     14
80      industry     13
81    supportive     13
83      customer     13
85  Construction     13
86        highly     12
88        driven     12
89   Development     12

### Count words to plot - Individual fields (Construction, Engineering, Healthcare, Sales, Community Services)

In [14]:
# Create DF for each job field

construction_df = seek_data_df[seek_data_df['job_classification']=='Construction']
engineering_df = seek_data_df[seek_data_df['job_classification']=='Engineering']
healthcare_medical_df = seek_data_df[seek_data_df['job_classification']=='Healthcare & Medical']
sales_df = seek_data_df[seek_data_df['job_classification']=='Sales']
jobs_in_community_services_development_df = seek_data_df[seek_data_df['job_classification']=='Community Services & Development']

In [15]:
# create word count DF for each job field
# word cloud
# count, tally and describe words in short_description


# construction

construction_count = (construction_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

# engineering

engineering_count = (engineering_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

# healthcare

healthcare_medical_count = (healthcare_medical_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

# sales

sales_count = (sales_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

# community service
jobs_in_community_services_development_count = (jobs_in_community_services_development_df['short_description'].str.split(expand=True)
              .stack()
              .value_counts()
              .rename_axis('word')
              .reset_index(name='count'))

In [16]:
####### Test area - remove words less than or equal to 4 characters

community_services_development_count_df = jobs_in_community_services_development_count[jobs_in_community_services_development_count['word'].str.len() > 4]
community_services_development_count_df

              word  count
5           people     15
7            their     14
13         Support     10
15      experience      8
17     opportunity      7
..             ...    ...
421        Waalitj      1
422        elderly      1
424  Psychologists      1
425        forward      1
427   Psychologist      1

[307 rows x 2 columns]

In [17]:
# remove words with less than 5 characters

construction_count = construction_count[construction_count['word'].str.len() > 4]
engineering_count = engineering_count[engineering_count['word'].str.len() > 4]
healthcare_medical_count = healthcare_medical_count[healthcare_medical_count['word'].str.len() > 4]
sales_count = sales_count[sales_count['word'].str.len() > 4]
jobs_in_community_services_development_count = jobs_in_community_services_development_count[jobs_in_community_services_development_count['word'].str.len() > 4]

In [18]:
jobs_in_community_services_development_count

              word  count
5           people     15
7            their     14
13         Support     10
15      experience      8
17     opportunity      7
..             ...    ...
421        Waalitj      1
422        elderly      1
424  Psychologists      1
425        forward      1
427   Psychologist      1

[307 rows x 2 columns]

### Count locations to plot

-----

In [19]:
# seek_data_df
# jobs_in_community_services_development_df

In [20]:
# create df for location counts 
# heatmap plot

all_fields_locations = seek_data_df['job_location'].value_counts()
construction_locations = construction_df['job_location'].value_counts()
engineering_locations = engineering_df['job_location'].value_counts()
healthcare_medical_locations = healthcare_medical_df['job_location'].value_counts()
sales_locations = sales_df['job_location'].value_counts()
jobs_in_community_services_development_locations = jobs_in_community_services_development_df['job_location'].value_counts()

all_fields_locations_df = pd.DataFrame(all_fields_locations)
construction_locations_df = pd.DataFrame(construction_locations)
engineering_locations_df = pd.DataFrame(engineering_locations)
healthcare_medical_locations_df = pd.DataFrame(healthcare_medical_locations)
sales_locations_df = pd.DataFrame(sales_locations)
jobs_in_community_services_development_df = pd.DataFrame(jobs_in_community_services_development_locations)

# sales_locations_df
# construction_locations_df
# healthcare_medical_locations_df
# sales_locations_df
jobs_in_community_services_development_df

                   job_location
Perth WA                     16
Rockingham                    3
Fremantle                     2
Cloverdale                    2
Osborne Park                  2
Bayswater                     2
Kwinana Beach                 2
Rivervale                     2
Bentley                       1
Singleton                     1
Mirrabooka                    1
Claremont                     1
Alexander Heights             1
West Perth                    1
Butler                        1
Success                       1
Balga                         1
Hilton                        1
Joondalup                     1
Wooroloo                      1
Wanneroo                      1
Mount Pleasant                1
Belmont                       1
Quinns Rocks                  1
Kalamunda                     1
Tuart Hill                    1
Mosman Park                   1
Malaga                        1

In [21]:
# reset index for tables
all_fields_locations_df.reset_index(inplace=True)
sales_locations_df.reset_index(inplace=True)
construction_locations_df.reset_index(inplace=True)
healthcare_medical_locations_df.reset_index(inplace=True)
engineering_locations_df.reset_index(inplace=True)
jobs_in_community_services_development_df.reset_index(inplace=True)

In [22]:
# rename columns to be more friendly
all_fields_locations_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
engineering_locations_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
construction_locations_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
healthcare_medical_locations_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
sales_locations_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
jobs_in_community_services_development_df.rename(columns= {'index':'Location', 'job_location':'Count'}, inplace=True)
engineering_locations_df

                        Location  Count
0                       Perth WA     68
1                      Henderson      4
2                        Belmont      4
3                      Welshpool      3
4                         Malaga      3
5                   Osborne Park      3
6                      Hazelmere      3
7                      Bayswater      2
8   Fremantle & Southern Suburbs      2
9                      Cottesloe      2
10                    West Perth      2
11                    Rockingham      1
12                       Midland      1
13                    Bibra Lake      1
14                    Bassendean      1
15                    East Perth      1
16               North Fremantle      1
17                  High Wycombe      1
18                     Fremantle      1
19                   Leederville      1
20                       Kewdale      1
21                    Maddington      1
22                  Canning Vale      1
23                       Bentley      1
24                 Kwinana Beach      1

In [23]:
# seek_csv_data = seek_count.to_csv('seek_count.csv', index = True)
# print('\nCSV String:\n', seek_csv_data)

------

In [24]:
# skills count? 
# for dendograms

###### just use the same data as word cloud

### Connect to postgres and load data to db

-----

In [30]:
# MOVE TO TOP BEFORE SUBMITTING

from api_keys import postgres_p
from sqlalchemy import create_engine
from sqlalchemy import inspect

In [31]:
protocol = 'postgresql'
username = 'postgres'
password = postgres_p

host = 'localhost'

port = 5432

database_name = 'Project_3'

rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)
insp = inspect(engine)

insp.get_table_names()

['job_id',
 'construction_scrapes',
 'engineering_scrapes',
 'healthcare_scrapes',
 'sales_scrapes',
 'community_service_scrapes',
 'construction_location_count',
 'engineering_location_count',
 'healthcare_location_count',
 'sales_location_count',
 'community_services_location_count',
 'sales_word_count',
 'community_services_word_count',
 'healthcare_word_count',
 'construction_word_count',
 'engineering_word_count',
 'all_fields_word_count']

In [43]:
############################ NEED TO BUILD JOB ID TABLE AND POST FIRST 


job_id_df.to_sql(name='job_id', con=engine, if_exists='append', index=False)

## Scrape Table Load
construction_df 
engineering_df 
healthcare_medical_df
sales_df
jobs_in_community_services_development_df
## Word Table Load

## Location Table Load



pd.read_sql_query('select * from job_id', con=engine).head(15)

    job_id     job_field                  job_location
0        0  Construction  Fremantle & Southern Suburbs
1        1  Construction              Cockburn Central
2        2  Construction                     Rivervale
3        3  Construction                      Perth WA
4        4  Construction                        Myaree
5        5  Construction                       Belmont
6        6  Construction                      Clarkson
7        7  Construction                  Osborne Park
8        8  Construction                      Perth WA
9        9  Construction                  Osborne Park
10      10  Construction              Peppermint Grove
11      11  Construction                      Balcatta
12      12  Construction                      Perth WA
13      13  Construction                      Perth WA
14      14  Construction  Fremantle & Southern Suburbs